package com.kh.mo.meatandbread.util

import com.kh.mo.meatandbread.R

object Constants {
 const val  hwa:String="hwa"
 const val  meat:String="meat"
 const val  proMeat:String="proMeat"
 const val CHANNEL_ID="Channel_id"
 const val TIME="TIME"
 const val PROGRESS="PROGRESS"
 const val PREFERENCE_NAME = "PREFERENCE_NAME"


 const val hwa1 = "حواوشي بلدي"
 const val hwa2 = "حواوشي خضار"
 const val hwa3 = "حواوشي مكس جبن"
 const val hwa4 = "حواوشي موتزريلا"
 const val hwa5 = "حواوشي جبنه رومي"
 const val hwa6 = "حواوشي جبن مدخنه"
 const val hwa1Details = "الحواوشي البلدي هو عبارة عن عجينة عيش محشوة باللحم المفروم والبصل والثوم والتوابل , يتميز الحواوشي البلدي بمذاقه اللذيذ ورائحته الشهية , يستغرق تلت ساعة من وقت طلب الطلب."
 const val hwa2Details = "الحواوشي الخضار هو عبارة عن عجينة عيش محشوة بالخضروات مثل الفلفل والطماطم والبصل , يتميز الحواوشي الخضار بمذاقه الخفيف ورائحته الشهية , يستغرق تلت ساعة من وقت طلب الطلب."
 const val hwa3Details ="الحواوشي مكس جبن هو عبارة عن عجينة عيش محشوة باللحم المفروم والبصل والثوم والتوابل، بالإضافة إلى الجبن الموزاريلا والجبنة الرومى , يتميز الحواوشي مكس جبن بمذاقه اللذيذ ورائحته الشهية , يستغرق نص ساعة و خمس دقائق من وقت طلب الطلب.<"
 const val hwa4Details ="الحواوشي الموتزريلا هو عبارة عن عجينة عيش محشوة باللحم المفروم والبصل والثوم والتوابل، بالإضافة إلى الجبن الموزاريلا , يتميز الحواوشي الموتزريلا بمذاقه اللذيذ ورائحته الشهية , يستغرق نص ساعة و خمس دقائق من وقت طلب الطلب."
 const val hwa5Details ="الحواوشي الجبنة الرومى هو عبارة عن عجينة عيش محشوة باللحم المفروم والبصل والثوم والتوابل، بالإضافة إلى الجبنة الرومى , يتميز الحواوشي الجبنة الرومى بمذاقه اللذيذ ورائحته الشهية , يستغرق نص ساعة و خمس دقائق من وقت طلب الطلب."
 const val hwa6Details = "الحواوشي الجبن المدخنة هو عبارة عن عجينة عيش محشوة باللحم المفروم والبصل والثوم والتوابل، بالإضافة إلى الجبن المدخنة , يتميز الحواوشي الجبن المدخنة بمذاقه اللذيذ ورائحته الشهية , يستغرق نص ساعة  و خمس دقائق من وقت طلب الطلب.<"
 const val mealQuantityHwa = "١ رغيف"
 const val mealQuantityHwaUnit = "رغيف"





 const val meat1 = "موزة"
 const val meat2 = "تربيانكو"
 const val meat3 ="وش فخدة"
 const val meat4 = "كولاطه"
 const val meat5 = "انتركوت"
 const val meat6 = "لحم ملبس"
 const val meat7 = "دوش"
 const val meat8= "قشره اللوح"
 const val meat9 = "عرق فلتو"
 const val meat10 = "سمانه"
 const val meat11 = "كوارع"
 const val meat1Details = " الموزة هو لحم طري يُقطع من فخذي العجل، ويكون سعر الكيلو منه ٣١٠ جنيه. يتميز لحم الموزة بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد."
 const val meat2Details = "لحم عرق التربيانكو هو لحم طري يُقطع من ظهر العجل، ويكون سعر الكيلو منه ٣١٠ جنيه. يتميز لحم عرق التربيانكو بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد."
 const val meat3Details = "لحم وش الفخذ هو لحم طري يُقطع من مقدمة الفخذ، ويكون سعر الكيلو منه ٣١٠ جنيه. يتميز لحم وش الفخذ بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد."
 const val meat4Details = "لحم الكولاثة هو لحم غني بالدهون يُقطع من الرقبة، ويكون سعر الكيلو منه ٣٠٠ جنيه. يتميز لحم الكولاثة بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والدهون الصحية."
 const val meat5Details = " الانتركوت هو لحم طري يُقطع من ظهر العجل، ويكون سعر الكيلو منه ٣٠٠ جنيه. يتميز لحم الانتركوت بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد.</string>"
 const val meat6Details = "لحم ملبس هو لحم غني بالدهون يُقطع من البطن، ويكون سعر الكيلو منه ٢٨٠ جنيه. يتميز لحم ملبس بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والدهون الصحية."
 const val meat7Details = "لحم الدوش هو لحم غني بالدهون يُقطع من الرقبة، ويكون سعر الكيلو منه ٣٠٠ جنيه. يتميز لحم الدوش بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والدهون الصحية."
 const val meat8Details = " قشره اللوح هو لحم طري يُقطع من ظهر العجل، ويكون سعر الكيلو منه ٣٠٠ جنيه. يتميز لحم قشره اللوح بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد."
 const val meat9Details = " عرق الفلتو هو لحم طري يُقطع من ظهر العجل، ويكون سعر الكيلو منه ٣١٠ جنيه. يتميز لحم عرق الفلتو بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والحديد."
 const val meat10Details = "لحم السمانة هو لحم غني بالدهون يُقطع من البطن، ويكون سعر الكيلو منه ٣١٠ جنيه. يتميز لحم السمانة بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للبروتين والدهون الصحية."
 const val meat11Details = "لحم الكوارع هو لحم غني بالكالسيوم والبروتين، ويكون سعر الكيلو منه ٢٨٠ جنيه. يتميز لحم الكوارع بمذاقه اللذيذ وقوامه الطري، كما أنه يعتبر مصدرًا جيدًا للكالسيوم والبروتين."
const val mealQuantityMeat="٢٥٠  جرام"

const val kofta="بلدي  كفته"
const val koftaDetails="الكفتة البلدية هي عبارة عن لحم مفروم مخلوط بالبصل والثوم والتوابل , تتميز الكفتة البلدية بمذاقها اللذيذ وطعمها الغني , متوفرة دائماً."
const val burger="بلدي  برجر"
const val burgerDetails=" البلدي هو عبارة عن لحم مفروم مخلوط بالبصل والثوم والتوابل، ثم يُشكل على شكل أقراص , يتميز البرجر البلدي بمذاقه اللذيذ وقوامه الطري , متوفرة دائماً.\n"
 const val mealQuantityProMeat="٥٠٠  جرام"



}